FC_Lists_Sand_2022/FC_Baseline_Tests.yml
execution:
#- executor: jmeter
- concurrency: 250
  ramp-up: 250s
  hold-for: 55m
  scenario: List_Api_Service

scenarios:
  List_Api_Service:
    script: List_Api_Service.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed